app/controllers/users_controller.rb

INSERT INTO "users" ("username", "persistence_token", "updated_at", "email", "password_salt", "crypted_password", "created_at") VALUES ('paul', '7f778b1993af15b05898f7fe4bf9e6b2a89f5f70af6605aa4083a6218864691a40f700cafe0b8aa9bea1df70dc98e095fc7a85ee5311458e1be4a79ef00e6f31', '2011-12-19 23:03:49.280432', 'paul@live.ie', 'K4r7mpG2WgXMGgB16C7', '4af48297c557c5a1df9fb6cfa09ec2bcec254a98fe8d51cc50277eb89468c27e41058722d99ef00869b6b16b607907ed792ffb5f6027f19af10611514bf88185', '2011-12-19 23:03:49.280432')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save